apache/nuttx/arch/arm/src/xmc4/chip/xmc4_ports.h
#define IOCR_OUTPUT                 16        /* General-purpose output */
#define IOCR_OUTPUT_ALT1            17        /* Alternate output function 1 */
#define IOCR_OUTPUT_ALT2            18        /* Alternate output function 2 */
#define IOCR_OUTPUT_ALT3            19        /* Alternate output function 3 */
#define IOCR_OUTPUT_ALT4            20        /* Alternate output function 4 */

/* Any of the above may be OR'ed with */
/* Open drain output */

#define IOCR_OUTPUT_OPENDRAIN       8         /* Output drain output modifier */

/* Port Input/Output Control Register 0 */

#define PORT_IOCR0_PC_SHIFT(p)      (((p) << 3) + 3)
#define PORT_IOCR0_PC_MASK(p)       (31 << PORT_IOCR0_PC_SHIFT(p))
#  define PORT_IOCR0_PC(p,n)        ((uint32_t)(n) << PORT_IOCR0_PC_SHIFT(p))
#define PORT_IOCR0_PC0_SHIFT        (3)       /* Bit 3-7: Port Control for Port n Pin 0 */
#define PORT_IOCR0_PC0_MASK         (31 << PORT_IOCR0_PC0_SHIFT)
#  define PORT_IOCR0_PC0(n)         ((uint32_t)(n) << PORT_IOCR0_PC0_SHIFT)
#define PORT_IOCR0_PC1_SHIFT        (11)      /* Bit 11-15: Port Control for Port n Pin 1 */
#define PORT_IOCR0_PC1_MASK         (31 << PORT_IOCR0_PC1_SHIFT)
#  define PORT_IOCR0_PC1(n)         ((uint32_t)(n) << PORT_IOCR0_PC1_SHIFT)
#define PORT_IOCR0_PC2_SHIFT        (19)      /* Bit 19-23: Port Control for Port n Pin 2 */
#define PORT_IOCR0_PC2_MASK         (31 << PORT_IOCR0_PC2_SHIFT)
#  define PORT_IOCR0_PC2(n)         ((uint32_t)(n) << PORT_IOCR0_PC2_SHIFT)
#define PORT_IOCR0_PC3_SHIFT        (27)      /* Bit 27-31: Port Control for Port 0 Pin 3 */
#define PORT_IOCR0_PC3_MASK         (31 << PORT_IOCR0_PC3_SHIFT)
#  define PORT_IOCR0_PC3(n)         ((uint32_t)(n) << PORT_IOCR0_PC3_SHIFT)

/* Port Input/Output Control Register 4 */

#define PORT_IOCR4_PC_SHIFT(p)      ((((p) - 4) << 3) + 3)
#define PORT_IOCR4_PC_MASK(p)       (31 << PORT_IOCR4_PC_SHIFT(p))
#  define PORT_IOCR4_PC(p,n)        ((uint32_t)(n) << PORT_IOCR4_PC_SHIFT(p))
#define PORT_IOCR4_PC4_SHIFT        (3)       /* Bit 3-7: Port Control for Port n Pin 4 */
#define PORT_IOCR4_PC4_MASK         (31 << PORT_IOCR4_PC4_SHIFT)
#  define PORT_IOCR4_PC4(n)         ((uint32_t)(n) << PORT_IOCR4_PC4_SHIFT)
#define PORT_IOCR4_PC5_SHIFT        (11)      /* Bit 11-15: Port Control for Port n Pin 5 */
#define PORT_IOCR4_PC5_MASK         (31 << PORT_IOCR4_PC5_SHIFT)
#  define PORT_IOCR4_PC5(n)         ((uint32_t)(n) << PORT_IOCR4_PC5_SHIFT)
#define PORT_IOCR4_PC6_SHIFT        (19)      /* Bit 19-23: Port Control for Port n Pin 6 */
#define PORT_IOCR4_PC6_MASK         (31 << PORT_IOCR4_PC6_SHIFT)
#  define PORT_IOCR4_PC6(n)         ((uint32_t)(n) << PORT_IOCR4_PC6_SHIFT)
#define PORT_IOCR4_PC7_SHIFT        (27)      /* Bit 27-31: Port Control for Port 0 Pin 7 */
#define PORT_IOCR4_PC7_MASK         (31 << PORT_IOCR4_PC7_SHIFT)
#  define PORT_IOCR4_PC7(n)         ((uint32_t)(n) << PORT_IOCR4_PC7_SHIFT)

/* Port Input/Output Control Register 8 */

#define PORT_IOCR8_PC_SHIFT(p)      ((((p) - 8) << 3) + 3)
#define PORT_IOCR8_PC_MASK(p)       (31 << PORT_IOCR8_PC_SHIFT(p))
#  define PORT_IOCR8_PC(p,n)        ((uint32_t)(n) << PORT_IOCR8_PC_SHIFT(p))
#define PORT_IOCR8_PC8_SHIFT        (3)       /* Bit 3-7: Port Control for Port n Pin 8 */
#define PORT_IOCR8_PC8_MASK         (31 << PORT_IOCR8_PC8_SHIFT)
#  define PORT_IOCR8_PC8(n)         ((uint32_t)(n) << PORT_IOCR8_PC8_SHIFT)
#define PORT_IOCR8_PC9_SHIFT        (11)      /* Bit 11-15: Port Control for Port n Pin 9 */
#define PORT_IOCR8_PC9_MASK         (31 << PORT_IOCR8_PC9_SHIFT)
#  define PORT_IOCR8_PC9(n)         ((uint32_t)(n) << PORT_IOCR8_PC9_SHIFT)
#define PORT_IOCR8_PC10_SHIFT       (19)      /* Bit 19-23: Port Control for Port n Pin 10 */
#define PORT_IOCR8_PC10_MASK        (31 << PORT_IOCR8_PC10_SHIFT)
#  define PORT_IOCR8_PC10(n)        ((uint32_t)(n) << PORT_IOCR8_PC10_SHIFT)
#define PORT_IOCR8_PC11_SHIFT       (27)      /* Bit 17-31: Port Control for Port 0 Pin 11 */
#define PORT_IOCR8_PC11_MASK        (31 << PORT_IOCR8_PC11_SHIFT)
#  define PORT_IOCR8_PC11(n)        ((uint32_t)(n) << PORT_IOCR8_PC11_SHIFT)

/* Port Input/Output Control Register 12 */

#define PORT_IOCR12_PC_SHIFT(p)     ((((p) - 12) << 3) + 3)
#define PORT_IOCR12_PC_MASK(p)      (31 << PORT_IOCR12_PC_SHIFT(p))
#  define PORT_IOCR12_PC(p,n)       ((uint32_t)(n) << PORT_IOCR12_PC_SHIFT(p))
#define PORT_IOCR12_PC12_SHIFT      (3)       /* Bit 3-7: Port Control for Port n Pin 12 */
#define PORT_IOCR12_PC12_MASK       (31 << PORT_IOCR12_PC12_SHIFT)
#  define PORT_IOCR12_PC12(n)       ((uint32_t)(n) << PORT_IOCR12_PC12_SHIFT)
#define PORT_IOCR12_PC13_SHIFT      (11)      /* Bit 3-7: Port Control for Port n Pin 13 */
#define PORT_IOCR12_PC13_MASK       (31 << PORT_IOCR12_PC13_SHIFT)
#  define PORT_IOCR12_PC13(n)       ((uint32_t)(n) << PORT_IOCR12_PC13_SHIFT)
#define PORT_IOCR12_PC14_SHIFT      (19)      /* Bit 3-7: Port Control for Port n Pin 14 */
#define PORT_IOCR12_PC14_MASK       (31 << PORT_IOCR12_PC14_SHIFT)
#  define PORT_IOCR12_PC14(n)       ((uint32_t)(n) << PORT_IOCR12_PC14_SHIFT)
#define PORT_IOCR12_PC15_SHIFT      (27)      /* Bit 3-7: Port Control for Port 0 Pin 15 */
#define PORT_IOCR12_PC15_MASK       (31 << PORT_IOCR12_PC15_SHIFT)
#  define PORT_IOCR12_PC15(n)       ((uint32_t)(n) << PORT_IOCR12_PC15_SHIFT)

/* Pad driver field values */
/* Pad class A1: */

#define PDR_PADA1_MEDIUM           0         /* Medium driver */
#define PDR_PADA1_WEAK             1         /* Weak driver */

/* Pad class A1+: */

#define PDR_PADA1P_STRONGSOFT      0         /* Strong driver soft edge */
#define PDR_PADA1P_STRONGSLOW      1         /* Strong driver slow edge */
#define PDR_PADA1P_MEDIUM          4         /* Medium driver */
#define PDR_PADA1P_WEAK            5         /* Weak driver */

/* Pad class A2: */

#define PDR_PADA2_STRONGSHARP      0         /* Strong driver sharp edge */
#define PDR_PADA2_STRONGMEDIUM     1         /* Strong driver medium edge */
#define PDR_PADA2_STRONGSOFT       2         /* Strong driver soft edge */
#define PDR_PADA2_MEDIUM           4         /* Medium driver */
#define PDR_PADA2_WEAK             7         /* Weak driver */

/* Port Pad Driver Mode 0 Register */

#define PORT_PDR0_PD_SHIFT(p)      ((p) << 2)
#define PORT_PDR0_PD_MASK(p)       (7 << PORT_PDR0_PD_SHIFT(p))
#  define PORT_PDR0_PD(p,n)        ((uint32_t)(n) << PORT_PDR0_PD_SHIFT(p))
#define PORT_PDR0_PD0_SHIFT        (0)       /* Bit 0-2: Pad Driver Mode for Port n Pin 0 */
#define PORT_PDR0_PD0_MASK         (7 << PORT_PDR0_PD0_SHIFT)
#  define PORT_PDR0_PD0(n)         ((uint32_t)(n) << PORT_PDR0_PD0_SHIFT)
#define PORT_PDR0_PD1_SHIFT        (4)       /* Bit 4-6: Pad Driver Mode for Port n Pin 1 */
#define PORT_PDR0_PD1_MASK         (7 << PORT_PDR0_PD1_SHIFT)
#  define PORT_PDR0_PD1(n)         ((uint32_t)(n) << PORT_PDR0_PD1_SHIFT)
#define PORT_PDR0_PD2_SHIFT        (8)       /* Bit 8-10: Pad Driver Mode for Port n Pin 2 */
#define PORT_PDR0_PD2_MASK         (7 << PORT_PDR0_PD2_SHIFT)
#  define PORT_PDR0_PD2(n)         ((uint32_t)(n) << PORT_PDR0_PD2_SHIFT)
#define PORT_PDR0_PD3_SHIFT        (12)      /* Bit 12-14: Pad Driver Mode for Port 0 Pin 3 */
#define PORT_PDR0_PD3_MASK         (7 << PORT_PDR0_PD3_SHIFT)
#  define PORT_PDR0_PD3(n)         ((uint32_t)(n) << PORT_PDR0_PD3_SHIFT)
#define PORT_PDR0_PD4_SHIFT        (16)      /* Bit 16-18: Pad Driver Mode for Port 0 Pin 4 */
#define PORT_PDR0_PD4_MASK         (7 << PORT_PDR0_PD4_SHIFT)
#  define PORT_PDR0_PD4(n)         ((uint32_t)(n) << PORT_PDR0_PD4_SHIFT)
#define PORT_PDR0_PD5_SHIFT        (20)      /* Bit 20-22: Pad Driver Mode for Port 0 Pin 5 */
#define PORT_PDR0_PD5_MASK         (7 << PORT_PDR0_PD5_SHIFT)
#  define PORT_PDR0_PD5(n)         ((uint32_t)(n) << PORT_PDR0_PD5_SHIFT)
#define PORT_PDR0_PD6_SHIFT        (24)      /* Bit 24-26: Pad Driver Mode for Port 0 Pin 6 */
#define PORT_PDR0_PD6_MASK         (7 << PORT_PDR0_PD6_SHIFT)
#  define PORT_PDR0_PD6(n)         ((uint32_t)(n) << PORT_PDR0_PD6_SHIFT)
#define PORT_PDR0_PD7_SHIFT        (28)      /* Bit 28-30: Pad Driver Mode for Port 0 Pin 7 */
#define PORT_PDR0_PD7_MASK         (7 << PORT_PDR0_PD7_SHIFT)
#  define PORT_PDR0_PD7(n)         ((uint32_t)(n) << PORT_PDR0_PD7_SHIFT)

