apache/nuttx/arch/arm/src/xmc4/chip/xmc4_ports.h
/* Port Pad Driver Mode 1 Register */

#define PORT_PDR1_PD_SHIFT(p)      (((p) - 8) << 2)
#define PORT_PDR1_PD_MASK(p)       (7 << PORT_PDR1_PD_SHIFT(p))
#  define PORT_PDR1_PD(p,n)        ((uint32_t)(n) << PORT_PDR1_PD_SHIFT(p))
#define PORT_PDR1_PD8_SHIFT        (0)       /* Bit 0-2: Pad Driver Mode for Port n Pin 8 */
#define PORT_PDR1_PD8_MASK         (7 << PORT_PDR1_PD8_SHIFT)
#  define PORT_PDR1_PD8(n)         ((uint32_t)(n) << PORT_PDR1_PD8_SHIFT)
#define PORT_PDR1_PD9_SHIFT        (4)       /* Bit 4-6: Pad Driver Mode for Port n Pin 9 */
#define PORT_PDR1_PD9_MASK         (7 << PORT_PDR1_PD9_SHIFT)
#  define PORT_PDR1_PD9(n)         ((uint32_t)(n) << PORT_PDR1_PD9_SHIFT)
#define PORT_PDR1_PD10_SHIFT       (8)       /* Bit 8-10: Pad Driver Mode for Port n Pin 10 */
#define PORT_PDR1_PD10_MASK        (7 << PORT_PDR1_PD10_SHIFT)
#  define PORT_PDR1_PD10(n)        ((uint32_t)(n) << PORT_PDR1_PD10_SHIFT)
#define PORT_PDR1_PD11_SHIFT       (12)      /* Bit 12-14: Pad Driver Mode for Port 0 Pin 11 */
#define PORT_PDR1_PD11_MASK        (7 << PORT_PDR1_PD11_SHIFT)
#  define PORT_PDR1_PD11(n)        ((uint32_t)(n) << PORT_PDR1_PD11_SHIFT)
#define PORT_PDR1_PD12_SHIFT       (16)      /* Bit 16-18: Pad Driver Mode for Port 0 Pin 12 */
#define PORT_PDR1_PD12_MASK        (7 << PORT_PDR1_PD12_SHIFT)
#  define PORT_PDR1_PD12(n)        ((uint32_t)(n) << PORT_PDR1_PD12_SHIFT)
#define PORT_PDR1_PD13_SHIFT       (20)      /* Bit 20-22: Pad Driver Mode for Port 0 Pin 13 */
#define PORT_PDR1_PD13_MASK        (7 << PORT_PDR1_PD13_SHIFT)
#  define PORT_PDR1_PD13(n)        ((uint32_t)(n) << PORT_PDR1_PD13_SHIFT)
#define PORT_PDR1_PD14_SHIFT       (24)      /* Bit 24-26: Pad Driver Mode for Port 0 Pin 14 */
#define PORT_PDR1_PD14_MASK        (7 << PORT_PDR1_PD14_SHIFT)
#  define PORT_PDR1_PD14(n)        ((uint32_t)(n) << PORT_PDR1_PD14_SHIFT)
#define PORT_PDR1_PD15_SHIFT       (28)      /* Bit 28-30: Pad Driver Mode for Port 0 Pin 15 */
#define PORT_PDR1_PD15_MASK        (7 << PORT_PDR1_PD15_SHIFT)
#  define PORT_PDR1_PD15(n)        ((uint32_t)(n) << PORT_PDR1_PD15_SHIFT)

/* Hardware select field values */

#define HWSEL_SOFTWARE             0          /* Software control only */
#define HWSEL_OVERRIDE0            1          /* HWI0/HWO0 control path can override the
                                               * software configuration */
#define HWSEL_OVERRIDE1            2          /* HWI1/HWO1 control path can override the
                                               * software configuration */

/* Port Pin Hardware Select Register */

#define PORT_HWSEL_HW_SHIFT(p)      ((p) << 1)
#define PORT_HWSEL_HW_MASK(p)       (3 << PORT_HWSEL_HW_SHIFT(p))
#  define PORT_HWSEL_HW(p,n)        ((uint32_t)(n) << PORT_HWSEL_HW_SHIFT(p))
#define PORT_HWSEL_HW0_SHIFT        (0)       /* Bit 0-1: Port n Pin 0 Hardware Select */
#define PORT_HWSEL_HW0_MASK         (3 << PORT_HWSEL_HW0_SHIFT)
#  define PORT_HWSEL_HW0(n)         ((uint32_t)(n) << PORT_HWSEL_HW0_SHIFT)
#define PORT_HWSEL_HW1_SHIFT        (2)       /* Bit 2-3: Port n Pin 1 Hardware Select */
#define PORT_HWSEL_HW1_MASK         (3 << PORT_HWSEL_HW1_SHIFT)
#  define PORT_HWSEL_HW1(n)         ((uint32_t)(n) << PORT_HWSEL_HW1_SHIFT)
#define PORT_HWSEL_HW2_SHIFT        (4)       /* Bit 4-5: Port n Pin 2 Hardware Select */
#define PORT_HWSEL_HW2_MASK         (3 << PORT_HWSEL_HW2_SHIFT)
#  define PORT_HWSEL_HW2(n)         ((uint32_t)(n) << PORT_HWSEL_HW2_SHIFT)
#define PORT_HWSEL_HW3_SHIFT        (6)       /* Bit 6-7: Port 0 Pin 3 Hardware Select */
#define PORT_HWSEL_HW3_MASK         (3 << PORT_HWSEL_HW3_SHIFT)
#  define PORT_HWSEL_HW3(n)         ((uint32_t)(n) << PORT_HWSEL_HW3_SHIFT)
#define PORT_HWSEL_HW4_SHIFT        (8)      /* Bit 8-9: Port 0 Pin 4 Hardware Select */
#define PORT_HWSEL_HW4_MASK         (3 << PORT_HWSEL_HW4_SHIFT)
#  define PORT_HWSEL_HW4(n)         ((uint32_t)(n) << PORT_HWSEL_HW4_SHIFT)
#define PORT_HWSEL_HW5_SHIFT        (10)      /* Bit 10-11: Port 0 Pin 5 Hardware Select */
#define PORT_HWSEL_HW5_MASK         (3 << PORT_HWSEL_HW5_SHIFT)
#  define PORT_HWSEL_HW5(n)         ((uint32_t)(n) << PORT_HWSEL_HW5_SHIFT)
#define PORT_HWSEL_HW6_SHIFT        (12)      /* Bit 12-13: Port 0 Pin 6 Hardware Select */
#define PORT_HWSEL_HW6_MASK         (3 << PORT_HWSEL_HW6_SHIFT)
#  define PORT_HWSEL_HW6(n)         14uint32_t)(n) << PORT_HWSEL_HW6_SHIFT)
#define PORT_HWSEL_HW7_SHIFT        (14)      /* Bit 14-15: Port 0 Pin 7 Hardware Select */
#define PORT_HWSEL_HW7_MASK         (3 << PORT_HWSEL_HW7_SHIFT)
#  define PORT_HWSEL_HW7(n)         ((uint32_t)(n) << PORT_HWSEL_HW7_SHIFT)
#define PORT_HWSEL_HW8_SHIFT        (16)      /* Bit 16-17: Port n Pin 8 Hardware Select */
#define PORT_HWSEL_HW8_MASK         (3 << PORT_HWSEL_HW8_SHIFT)
#  define PORT_HWSEL_HW8(n)         ((uint32_t)(n) << PORT_HWSEL_HW8_SHIFT)
#define PORT_HWSEL_HW9_SHIFT        (18)      /* Bit 18-19: Port n Pin 9 Hardware Select */
#define PORT_HWSEL_HW9_MASK         (3 << PORT_HWSEL_HW9_SHIFT)
#  define PORT_HWSEL_HW9(n)         ((uint32_t)(n) << PORT_HWSEL_HW9_SHIFT)
#define PORT_HWSEL_HW10_SHIFT       (20)      /* Bit 20-21: Port n Pin 10 Hardware Select */
#define PORT_HWSEL_HW10_MASK        (3 << PORT_HWSEL_HW10_SHIFT)
#  define PORT_HWSEL_HW10(n)        ((uint32_t)(n) << PORT_HWSEL_HW10_SHIFT)
#define PORT_HWSEL_HW11_SHIFT       (22)      /* Bit 22-23: Port 0 Pin 11 Hardware Select */
#define PORT_HWSEL_HW11_MASK        (3 << PORT_HWSEL_HW11_SHIFT)
#  define PORT_HWSEL_HW11(n)        ((uint32_t)(n) << PORT_HWSEL_HW11_SHIFT)
#define PORT_HWSEL_HW12_SHIFT       (24)      /* Bit 24-25: Port 0 Pin 12 Hardware Select */
#define PORT_HWSEL_HW12_MASK        (3 << PORT_HWSEL_HW12_SHIFT)
#  define PORT_HWSEL_HW12(n)        ((uint32_t)(n) << PORT_HWSEL_HW12_SHIFT)
#define PORT_HWSEL_HW13_SHIFT       (26)      /* Bit 26-27: Port 0 Pin 13 Hardware Select */
#define PORT_HWSEL_HW13_MASK        (3 << PORT_HWSEL_HW13_SHIFT)
#  define PORT_HWSEL_HW13(n)        ((uint32_t)(n) << PORT_HWSEL_HW13_SHIFT)
#define PORT_HWSEL_HW14_SHIFT       (28)      /* Bit 28-29: Port 0 Pin 14 Hardware Select */
#define PORT_HWSEL_HW14_MASK        (3 << PORT_HWSEL_HW14_SHIFT)
#  define PORT_HWSEL_HW14(n)        14uint32_t)(n) << PORT_HWSEL_HW14_SHIFT)
#define PORT_HWSEL_HW15_SHIFT       (30)      /* Bit 30-31: Port 0 Pin 15 Hardware Select */
#define PORT_HWSEL_HW15_MASK        (3 << PORT_HWSEL_HW15_SHIFT)
#  define PORT_HWSEL_HW15(n)        ((uint32_t)(n) << PORT_HWSEL_HW15_SHIFT)

#endif /* __ARCH_ARM_SRC_XMC4_CHIP_XMC4_SCU_H */
